
Im Alive 

listening on('127.0.0.23', 65432)

 Data outbound: 

ip: "127.0.0.23"
data: "hey there Im up"
l_Clock: 0.23

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
data: "hey there Im up"
l_Clock: 0.23

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 18.11
rID: 7

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 3.23
rID: 7

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 3.23
rID: 7

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 16.11
rID: 5

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key2"
l_Clock: 5.22
rID: 3

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 4.21
rID: 6

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: GET
ack: OK
data: "key3"
l_Clock: 24.11
rID: 11

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 8.21
rID: 7

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 30.11
rID: 14

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 11.219999999999999
rID: 6

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 14.219999999999999
rID: 7

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
data: "Get Failure"
l_Clock: 14.23
rID: 7

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 15.23
rID: 6

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 16.23
rID: 6


processing: ['key2', 'second']

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 17.23
rID: 3

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 18.23
rID: 3

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 35.11
rID: 16

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 37.11
rID: 17

Inbound Msg:
ip: "127.0.0.11"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 38.11
rID: 18

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 15.21
rID: 3

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 6.23
rID: 5

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 6.23
rID: 5

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 6.21
rID: 4

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 24.23
rID: 4

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 25.23
rID: 4

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 7.22
rID: 2

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 27.22
rID: 4


processing: ['key1', 'firstOW']

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 31.22
rID: 5

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 24.21
rID: 5


processing: ['key1', 'first']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 30.23
rID: 5

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 31.23
rID: 2

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 32.230000000000004
rID: 2

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 27.21
rID: 2


processing: ['key1', 'firstOOW']

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "key3"
l_Clock: 8.23
rID: 11

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "key3"
l_Clock: 8.23
rID: 11

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key3"
l_Clock: 7.22
rID: 8

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 37.230000000000004
rID: 8

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 38.230000000000004
rID: 8

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 32.21
rID: 11

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 34.21
rID: 8

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 8.219999999999999
rID: 1

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 42.230000000000004
rID: 1

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 43.230000000000004
rID: 1

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 38.21
rID: 1

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 8.219999999999999
rID: 9

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 46.230000000000004
rID: 9

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 47.230000000000004
rID: 9

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 42.21
rID: 9


processing: ['key3', 'third']

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 54.22
rID: 11

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "third"
l_Clock: 51.230000000000004
rID: 11

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 11.23
rID: 14

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 11.23
rID: 14

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 9.219999999999999
rID: 10

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 54.230000000000004
rID: 10

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 55.230000000000004
rID: 10

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 47.21
rID: 10

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 51.21
rID: 14

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 62.22
rID: 14


processing: ['key1', 'first']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 59.230000000000004
rID: 14

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 19.23
rID: 16

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 19.23
rID: 16

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key2"
l_Clock: 16.22
rID: 12

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 63.230000000000004
rID: 12

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 64.23
rID: 12

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 56.21
rID: 12

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 59.21
rID: 16

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 19.22
rID: 13

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 69.23
rID: 13

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 70.23
rID: 13

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 62.21
rID: 13

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 19.22
rID: 15

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 72.23
rID: 15

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 73.23
rID: 15

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 66.21000000000001
rID: 15


processing: ['key2', 'second']

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 82.22
rID: 16


processing: ['key3', 'third']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 76.23
rID: 16

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 20.23
rID: 17

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 20.23
rID: 17

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 85.22
rID: 17

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 71.21000000000001
rID: 17


processing: ['key1', 'firstOW']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 81.23
rID: 17

starting connection1to('127.0.0.21', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 20.23
rID: 18

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 20.23
rID: 18

Inbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 75.21000000000001
rID: 18

Inbound Msg:
ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 89.22
rID: 18


processing: ['key1', 'firstOOW']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 86.23
rID: 18

**Lin Queue is Empty ****!!!!
Logical clock:87.23
Outstanding requests:

processed requests:


7: [(3.23, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 3.23
rID: 7
), (11.440000000000001, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 8.21
rID: 7
), (17.45, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 14.219999999999999
rID: 7
)]

6: [(4.21, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 4.21
rID: 6
), (15.43, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 11.219999999999999
rID: 6
), (21.44, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 16.23
rID: 6
)]

3: [(5.22, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key2"
l_Clock: 5.22
rID: 3
), (24.45, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 18.23
rID: 3
), (20.43, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 15.21
rID: 3
)]

4: [(6.21, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 6.21
rID: 4
), (32.44, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 25.23
rID: 4
), (33.43, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 27.22
rID: 4
)]

5: [(6.23, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 6.23
rID: 5
), (37.45, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 31.22
rID: 5
), (30.44, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 24.21
rID: 5
)]

2: [(7.22, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 7.22
rID: 2
), (40.45, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 32.230000000000004
rID: 2
), (34.43, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 27.21
rID: 2
)]

8: [(7.22, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key3"
l_Clock: 7.22
rID: 8
), (46.45, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 38.230000000000004
rID: 8
), (41.43, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 34.21
rID: 8
)]

1: [(8.219999999999999, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 8.219999999999999
rID: 1
), (52.45, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 43.230000000000004
rID: 1
), (46.43, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 38.21
rID: 1
)]

9: [(8.219999999999999, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 8.219999999999999
rID: 9
), (56.45, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 47.230000000000004
rID: 9
), (50.43, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 42.21
rID: 9
)]

11: [(8.23, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "key3"
l_Clock: 8.23
rID: 11
), (40.44, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 32.21
rID: 11
), (62.45, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key3"
l_Clock: 54.22
rID: 11
)]

10: [(9.219999999999999, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 9.219999999999999
rID: 10
), (65.45, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 55.230000000000004
rID: 10
), (56.43, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 47.21
rID: 10
)]

14: [(11.23, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 11.23
rID: 14
), (62.44, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 51.21
rID: 14
), (73.45, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 62.22
rID: 14
)]

12: [(16.22, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key2"
l_Clock: 16.22
rID: 12
), (81.45, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 64.23
rID: 12
), (72.43, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key2"
l_Clock: 56.21
rID: 12
)]

13: [(19.22, ip: "127.0.0.22"
consis: LINEARIZED
request: GET
ack: OK
data: "key1"
l_Clock: 19.22
rID: 13
), (90.45, ip: "127.0.0.23"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 70.23
rID: 13
), (81.43, ip: "127.0.0.21"
consis: LINEARIZED
request: GET
ack: OK
data: "acknowledge key1"
l_Clock: 62.21
rID: 13
)]

15: [(19.22, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 19.22
rID: 15
), (93.45, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 73.23
rID: 15
), (85.43, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 66.21000000000001
rID: 15
)]

16: [(19.23, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 19.23
rID: 16
), (78.44, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 59.21
rID: 16
), (101.45, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 82.22
rID: 16
)]

17: [(20.23, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 20.23
rID: 17
), (105.45, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 85.22
rID: 17
), (91.44000000000001, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 71.21000000000001
rID: 17
)]

18: [(20.23, ip: "127.0.0.23"
consis: LINEARIZED
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 20.23
rID: 18
), (95.44000000000001, ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 75.21000000000001
rID: 18
), (109.45, ip: "127.0.0.22"
consis: LINEARIZED
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 89.22
rID: 18
)]

LinearPQ: []

SeqPQ: []

All consistencies DB : {'key2': 'second', 'key1': 'firstOOW', 'key3': 'third'}
Linearized consistency DB : {'key2': 'second', 'key1': 'firstOOW', 'key3': 'third'}
Sequential consistency DB : {}
Causal consistency DB : {}
Eventual consistency DB : {}