
Im Alive 

listening on('127.0.0.21', 65432)

 Data outbound: 

ip: "127.0.0.21"
data: "hey there Im up"
l_Clock: 0.21

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.21"
data: "hey there Im up"
l_Clock: 0.21

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 2.23
rID: 1

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 3.21
rID: 1

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 4.21
rID: 1

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 3.2199999999999998
rID: 1


processing: ['key1', 'first']

**Seq Queue is Empty ****!!!!
Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 8.219999999999999
rID: 2

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 8.21
rID: 2

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 9.21
rID: 2

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 9.23
rID: 2


processing: ['key3', 'third']

**Seq Queue is Empty ****!!!!
Inbound Msg:
ip: "127.0.0.11"
consis: SEQUENTIAL
request: GET
ack: OK
data: "key1"
l_Clock: 33.11
rID: 13

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: GET
data: "Get Failure"
l_Clock: 14.21
rID: 13

**Seq Queue is Empty ****!!!!
Inbound Msg:
ip: "127.0.0.11"
consis: SEQUENTIAL
request: GET
ack: OK
data: "key3"
l_Clock: 28.11
rID: 8

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: GET
data: "Get Failure"
l_Clock: 15.21
rID: 8

**Seq Queue is Empty ****!!!!
Inbound Msg:
ip: "127.0.0.11"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 36.11
rID: 16

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 16.21
rID: 16

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 16.21
rID: 16

Inbound Msg:
ip: "127.0.0.11"
consis: SEQUENTIAL
request: GET
ack: OK
data: "key2"
l_Clock: 23.11
rID: 3

Inbound Msg:
ip: "127.0.0.11"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 30.11
rID: 10

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 19.22
rID: 4

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 14.23
rID: 5

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 20.21
rID: 5

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 21.21
rID: 5

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 22.22
rID: 5


processing: ['key1', 'first']

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 26.22
rID: 16

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 21.23
rID: 16


processing: ['key1', 'firstOW']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 25.21
rID: 16

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: GET
data: "Get Failure"
l_Clock: 26.21
rID: 3

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 18.21
rID: 10

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 18.21
rID: 10

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 16.23
rID: 11

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 30.21
rID: 11

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 31.21
rID: 11

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 30.22
rID: 11


processing: ['key3', 'third']

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 34.22
rID: 10

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 16.23
rID: 15

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 35.21
rID: 15

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 36.21
rID: 15

Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 37.22
rID: 15


processing: ['key1', 'firstOW']

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 36.230000000000004
rID: 10


processing: ['key1', 'firstOOW']

starting connection1to('127.0.0.11', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: LINEARIZED
request: SET
ack: OK
data: "Set successful"
l_Clock: 40.21
rID: 10

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 41.21
rID: 4

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 42.21
rID: 4

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 38.230000000000004
rID: 4


processing: ['key2', 'second']

**Seq Queue is Empty ****!!!!
Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 21.22
rID: 9

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 44.21
rID: 9

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 45.21
rID: 9

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 42.230000000000004
rID: 9


processing: ['key2', 'second']

**Seq Queue is Empty ****!!!!
Inbound Msg:
ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 21.22
rID: 18

starting connection1to('127.0.0.22', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 48.21
rID: 18

starting connection1to('127.0.0.23', 65432)
Outbound Msg:
ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 49.21
rID: 18

Inbound Msg:
ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 46.230000000000004
rID: 18


processing: ['key1', 'firstOOW']

**Seq Queue is Empty ****!!!!
Logical clock:51.21
Outstanding requests:

processed requests:


1: [(2.23, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 2.23
rID: 1
), (7.4399999999999995, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 4.21
rID: 1
), (5.449999999999999, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 3.2199999999999998
rID: 1
)]

2: [(8.219999999999999, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 8.219999999999999
rID: 2
), (18.43, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 9.21
rID: 2
), (17.45, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 9.23
rID: 2
)]

13: [(13, ip: "127.0.0.11"
consis: SEQUENTIAL
request: GET
ack: OK
data: "key1"
l_Clock: 33.11
rID: 13
)]

8: [(8, ip: "127.0.0.11"
consis: SEQUENTIAL
request: GET
ack: OK
data: "key3"
l_Clock: 28.11
rID: 8
)]

5: [(14.23, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: first"
l_Clock: 14.23
rID: 5
), (36.44, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 21.21
rID: 5
), (36.45, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: first"
l_Clock: 22.22
rID: 5
)]

16: [(16.21, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 16.21
rID: 16
), (42.43, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 26.22
rID: 16
), (37.44, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 21.23
rID: 16
)]

3: [(3, ip: "127.0.0.11"
consis: SEQUENTIAL
request: GET
ack: OK
data: "key2"
l_Clock: 23.11
rID: 3
)]

11: [(16.23, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key3 ::: third"
l_Clock: 16.23
rID: 11
), (48.44, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 31.21
rID: 11
), (46.45, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key3 ::: third"
l_Clock: 30.22
rID: 11
)]

15: [(16.23, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOW"
l_Clock: 16.23
rID: 15
), (53.44, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 36.21
rID: 15
), (53.45, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOW"
l_Clock: 37.22
rID: 15
)]

10: [(18.21, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 18.21
rID: 10
), (52.43, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 34.22
rID: 10
), (54.440000000000005, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 36.230000000000004
rID: 10
)]

4: [(19.22, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 19.22
rID: 4
), (62.43, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 42.21
rID: 4
), (57.45, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 38.230000000000004
rID: 4
)]

9: [(21.22, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key2 ::: second"
l_Clock: 21.22
rID: 9
), (67.43, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 45.21
rID: 9
), (63.45, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key2 ::: second"
l_Clock: 42.230000000000004
rID: 9
)]

18: [(21.22, ip: "127.0.0.22"
consis: SEQUENTIAL
request: SET
ack: OK
data: "key1 ::: firstOOW"
l_Clock: 21.22
rID: 18
), (71.43, ip: "127.0.0.21"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 49.21
rID: 18
), (67.45, ip: "127.0.0.23"
consis: SEQUENTIAL
request: SET
ack: OK
data: "acknowledge key1 ::: firstOOW"
l_Clock: 46.230000000000004
rID: 18
)]

LinearPQ: []

SeqPQ: []

All consistencies DB : {'key1': 'firstOOW', 'key3': 'third', 'key2': 'second'}
Linearized consistency DB : {}
Sequential consistency DB : {'key1': 'firstOOW', 'key3': 'third', 'key2': 'second'}
Causal consistency DB : {}
Eventual consistency DB : {}